{"cnn.com": ["How US-made Bradley Fighting Vehicles helped Ukraine win the battle for Robotyne | CNN", "Boy rescued after spending the night clinging to a tree to escape deadly flooding in Spain | CNN", "Greece floods kill at least one as country grapples with 'totally extreme weather phenomenon' | CNN", "Peter Navarro, second ex-Trump aide to be prosecuted for contempt of Congress, faces trial Tuesday | CNN Politics", "Helicopter pilot to receive Medal of Honor for daring rescue during Vietnam War | CNN Politics", "Why even a popular bipartisan issue like firefighter pay may have trouble getting passed in Congress | CNN Politics", "CNN Exclusive: Special counsel election probe continues with focus on fundraising, voting equipment breaches | CNN Politics", "Rhode Island and Utah hold special election primaries for House seats | CNN Politics", "'Dinner plate sized' device found inside woman's abdomen 18 months after cesarean birth | CNN", "South Korean teachers hold mass protests after suicide highlights pressures from parents | CNN", "Biden jabs at Trump on Labor Day as he looks to shore up his union base | CNN Politics", "First lady Jill Biden tests positive for Covid-19 | CNN Politics", "Trump is in a league of his own as GOP primary hits fall sprint | CNN Politics", "What to know about Texas Attorney General Ken Paxton's impeachment trial | CNN Politics", "North Korea's Kim Jong Un may meet Putin in Russia to discuss arms deal, US says | CNN Politics", "How to fix your job so that you love it, in three steps | CNN", "Crimean Tatar set to become Ukrainian defense minister at critical moment in conflict | CNN", "'Hard and hostile' storm lashes Spain, leaving at least 2 dead | CNN", "'Let's give it a try,' recalls Russian pilot who defected to Ukraine in his military helicopter | CNN", "Madison Keys breezes past fellow US star Jessica Pegula to reach US Open quarterfinals | CNN", "Wisconsin GOP weighs moves to sideline elections chief and liberal Supreme Court majority | CNN Politics", "US Open: Defending champion Iga Świątek stunned by Jelena Ostapenko | CNN", "Zelensky replaces Ukrainian defense minister, citing need for 'new approaches' | CNN", "Live updates: Russia's war in Ukraine, attacks on Danube River ports in Odesa", "One year out, here's what we know about how the presidential race will look on Labor Day 2024 | CNN Politics", "In Japan, the young find dating so hard their parents are doing it for them | CNN", "North Korea says it has simulated a nuclear missile attack to warn US of 'nuclear war danger' | CNN", "Pope tells Chinese Catholics to be 'good citizens' as he hosts mass in neighboring Mongolia | CNN", "44 injured, thousands left without power as Typhoon Haikui hits Taiwan | CNN", "Sen. Tim Kaine says 'powerful argument' 14th Amendment could disqualify Trump | CNN Politics"], "bbc.co.uk": ["GB win three golds and four silvers at Worlds", "Strictly: Angela Rippon, Amanda Abbington and Layton Williams lead line-up", "Digital skills academy CodeClan goes into liquidation", "Cycling World Championships 2023: Great Britain win gold and silver in men's C3 1km time trial", "Rohan Shand: Boy, 15, found guilty of murdering teenager", "Florida deputy jumps onto a speeding runaway boat", "TikTok influencer and mother guilty of murdering men in crash", "Armed experts re-enact Parkland school shooting for lawsuit evidence", "Fire beat Brave in high-scoring Hundred thriller", "Couple's Caribbean holiday ruined by dead body, drugs and pool sex", "Killer who fled UK in dinghy jailed for murdering 15-year-old boy", "Six former Mississippi officers plead guilty to torturing two black men", "Scottish government loses bid to delay gender reform review", "World Cup places at stake as England face Wales", "Edinburgh Council amends 'unlawful' short-term lets plan", "Jacob Crouch: Stepfather jailed for life for 'brutal' baby murder", "The Hundred 2023: Maia Bouchier runs out Laura Harris on 20", "Eddie Izzard aims to stand in Brighton at next general election", "Bibby Stockholm: Police probe letter threats to migrant barge firms", "Title winners & relegation worries - pundits' Premiership predictions", "Met Police: Cdr Julian Bennett accused of cover-up over drugs test", "US jobs market holds steady despite rate rises", "Alexei Navalny: Russian opposition leader handed further 19 year jail term", "Sci-fi library book returned 53 years late", "Watchdog probe into Greater Manchester Police custody claims", "Swimmer breaks record for Oceans Seven challenge", "University of Bristol 'dismissed complaints' about sexist farmer", "Joe Rankin jailed for 24 years for Emma Potter murder", "Will there be another Commonwealth Games?", "UK Scouts pulled out of camp after S Korea heatwave"], "aljazeera.com": ["Who were the three Muslim men shot dead inside train by Indian armed guard?", "India’s Supreme Court suspends Rahul Gandhi’s defamation conviction", "Pakistan’s National Assembly likely to be dissolved on August 9", "Teacher stabbed at school in latest South Korean knife attack", "China to drop tariffs on Australian barley amid diplomatic thaw", "‘Fit for pigs’: Conditions in overcrowded Zimbabwe prisons choke inmates", "Denmark to tighten border controls after Quran burnings", "Is Barbie feminist? Not for all women", "Russia-Ukraine war: List of key events, day 527", "Niger’s Bazoum warns of ‘devastating’ fallout for world if coup succeeds", "Debt is America’s golden goose. Fitch can’t kill it", "Hong Kong targets exiles’ loved ones as crackdown turns to old CCP playbook", "US arrests Navy sailors over alleged schemes to send China military secrets", "Bodies found in Rio Grande spur criticism of US-Mexico border policies", "India’s wild price swings for tomatoes make and lose fortunes", "Warner Bros Discovery warns Hollywood strikes may impact film slate", "Donald Trump pleads not guilty to 2020 election charges", "Photos: Trump pleads not guilty in Washington, DC, to 2020 election charges", "US urges nations to tell Russia to stop using grain as ‘blackmail’", "Trump arraignment: The scene outside the Washington, DC court", "Trump ally charged for alleged role in 2020 Michigan vote tampering scheme", "Can Colombia make lasting peace with armed groups?", "Colombia to open migrant processing centres in US-led effort", "Photos: The fight to save ‘sacred’ Carpathian forests from loggers", "Lebanon warns army may intervene if Palestinian faction clashes continue", "Deforestation in Brazil’s Amazon falls to lowest level since 2017", "Women’s World Cup 2023: Fixtures and match schedule for Round of 16", "Middle East Roundup: Quran burnings lead to protests around the world", "Benin says Niger oil pipeline not impacted by regional sanctions over coup", "Challenge to Israeli law protecting PM from removal goes to Supreme Court"], "timesofindia.indiatimes.com": ["Special Pujas: Thousands Throng Temples, Riverbanks For Aadi Perukku | Coimbatore News - Times of India", "Irregularities found in minority scholarship schemes, says Smriti Irani | India News - Times of India", "Tomato raithula pai peruguthunna daadulu: Miscreants assault man with beer bottles, rob him of Rs 4.5 lakh in Andhra Pradesh's Chittoor district | Amaravati News - Times of India", "Delhi: Venezuela executive Vice President Delcy Rodriguez meeting with Vice President of India Jagdeep Dhankhar", "Latin American region is of primary importance to India: Mexico’s Ambassador to India | News - Times of India Videos", "Listed: 14 key sectors for which PLI schemes have been announced - The Times of India", "Myanmar Border: Rlys Plans To Link Myanmar Border Area With Mizoram | Guwahati News - Times of India", "Redefining tradition: Incorporating cultural elements in bespoke bridal fashion", "“INDIA against attack on federal structure…” Manickam Tagore on Delhi Services Bill | News - Times of India Videos", "Manjunath secures upset win in Australian Open; Sindhu, Srikanth, Prannoy enter second round | Badminton News - Times of India", "India Vs West Indies: 3rd ODI highlights: Clinical India outclass West Indies by 200 runs to seal the series 2-1 | Cricket News - Times of India", "Tamil Nadu man in Iraq sends wife clip of ‘harassment’, dies | India News - Times of India", "Circular economy – breaking down the buzzword", "Google: Google, Italy come to an agreement on data portability case: All details - Times of India", "Women's World Cup: Miyazawa brace helps Japan secure 4-0 victory over Spain | Football News - Times of India", "Indian women beat Spain 3-0 to win Spanish Federation hockey tournament | Hockey News - Times of India", "Semicon India 2023: EAM Jaishankar highlights India’s global partnerships in semiconductor industry | News - Times of India Videos", "It's destination Hyd for top biotech, life sciences firms | Hyderabad News - Times of India", "Manipur:  When Smriti Irani shouted at opposition over Manipur in Parliament | India News - Times of India", "Uttarakhand CM Dhami meets delegation from Nepal, says both countries are running parallel | News - Times of India Videos", "Kuwait: Kuwait executes 5 prisoners, including a man convicted in 2015 Islamic State-claimed mosque bombing - Times of India", "India clubbed with China, Bangladesh, Myanmar in men's draw; Thailand, Chinese Taipei in women's football | Football News - Times of India", "Kuwait hangs five, including 2015 mosque bombing convict - Times of India", "'Yeh Modi ki guarantee hai': PM says India will be among top 3 global economies in his next term | India News - Times of India", "Who will power the world", "Non-stops open up holiday spots off regular flight paths - Times of India", "South India’s largest textile expo, TAGEXPO, opens | Erode News - Times of India", "DK Shivakumar: Plot being hatched in Singapore to topple Karnataka govt says Deputy CM | Bengaluru News - Times of India", "Nepali woman hangs self in south Delhi | Delhi News - Times of India", "Iraqi Kurdistan demonstration in support of jailed journalist - Times of India"], "smh.com.au": ["Dogs put dagger through Tigers’ finals hopes as Pickett clashes with patron", "As it happened AFL 2023 round 21: Pickett in clash with touchy spectator as Bulldogs assert finals chances after blitzing Tigers", "Luai reported for high shot on Nelson", "NRL Highlights: Panthers v Storm - Round 23", "Penrith win again but sweat on Jarome Luai avoiding suspension", "'In my blood': Clarkson candid on return", "Fuming Luai voices 'slap' claim", "Cummins played final Test with a suspected fractured wrist", "To'o darts over", "‘Magic’ McLean’s key, but overlooked, role in fight against racism in football", "Peter Bol’s family demands apology", "Luai splits through Storm", "'I won't cop it': Ref fumes at ex-Storm gun running drinks", "Woman accused of throwing dog from carpark", "US military shows off nuclear capable sub in WA", "Storm strike in scrambling passage of play", "NRL Highlights: Titans v Warriors - Round 23", "‘The complete package’: Teen giant spearheads Qld’s next generation", "Treasure islands: Why SEQ’s hidden gems are growing three times as fast as mainland", "Titan sent off after sickening hit on Warrior", "School scrambles for room after accepting hundreds of kids over capacity", "Bentleys, brown paper bags and bundles: Newcastle can’t shake reputation for wheeling and dealing", "Asking Matildas super fans about their Word Cup experiences", "Waltzing Matildas chant breaks out at pub", "‘Once in a lifetime player’: Reece Walsh is tearing up the NRL. Can he be stopped?", "Manly set to offer Matt Lodge an NRL lifeline despite ACL tear", "Niukore sin-binned for face slap", "South Australians using electric cars to power homes", "“Ridiculous behaviour”: Perth’s mayor declares war on the vandal who damaged 100 city trees", "Albanese finds his Voice at Garma, as Yunupingu’s family pledge to carry on his work"], "foxnews.com": ["Colorado’s Shedeur Sanders discusses difference between FCS and FBS: ‘I don’t fear names’", "Video captures men attempting home invasion despite former detective firing gun to defend family", "Over 60 'militant anarchists' face RICO indictment over Atlanta 'Cop City' demonstrations, attacks on police", "Rural Michigan pickup crash kills 4", "Ex-Minneapolis policeman mourns cops being removed from schools after George Floyd's death", "Voters say they feel 'stuck,' don't want Trump-Biden rematch: No more political 'blood sports'", "UK lifts de facto ban on onshore wind development", "Is your favorite app selling your private information?", "Oil execs stand trial in Sweden for alleged involvement in Sudanese war crimes", "Biden to mask up indoors again after negative COVID test", "Texas AG Ken Paxton pleads not guilty to impeachment charges after Senate advances case to trial", "Greg Abbott brags of sending 35,000 migrants to sanctuary cities, says it provided 'critical relief' to Texans", "Liberal Washington Post columnist warns there's 'real risk' of Trump winning in 2024: 'Stupefies me'", "City of Pittsburgh is seeking archers to help deal with deer population crisis in parks", "The Hitchhiker’s Guide to McConnell’s health and a potential government shutdown", "Meghan Markle parties without Prince Harry at Beyoncé concert with Hollywood pals", "Prosecutors in all 50 states urge Congress to guard against AI-generated child pornography", "Death Valley National Park may take months to reopen following Tropical Storm Hilary", "'Defunded' Wisconsin police to increase patrols after young woman brutalized in college football town attack", "Patriots' JuJu Smith-Schuster's knee 'is a mess,' NFL insider suggests", "Owner of collapsed Iowa apartment building blames engineering company in new lawsuit", "London mayor pressed by Piers Morgan in interview to define 'woman'", "Chris Christie accuses DeSantis of 'playing politics' during Biden's Florida visit", "Rabid bats found in Utah, prompting warning from health officials", "Kim Jong Un publicizing daughter to secure loyalty for family, South Korean officials speculate", "Egypt resumes commercial flights to war-torn Sudan following 5-month hiatus", "Cartels exploit banana trade to smuggle cocaine from Latin America: report", "UN nuclear watchdog says 'no progress' has been made in monitoring Iranian nuclear program: report", "US consulate staff in Mexico told to 'shelter in place' amid border violence", "Austrian actor, who possessed and produced thousands of files of child porn, gets 2-year suspended sentence"], "msnbc.com": ["Opinion | The viral Chinese zoo sun bear video exposes a grim reality", "Opinion | A Trump campaign fundraising email exposes his main goal. It’s depressingly simple.", "Report underscores Judge Cannon's inexperience ahead of Trump trial", "Opinion | Trump's free speech defense is unlikely to work", "‘Savvy’: How Jack Smith made it so Trump's Jan. 6 trial will likely go first", "‘They got him’: Chris Hayes says this Trump arrest is ‘biggest of all time’", "Two unusual moments from Trump's arraignment", "Who is co-conspirator 6 in Trump's latest indictment? We know who they are not.", "Weissmann: I was a prosecutor for 21 years. I've never heard a judge warn a defendant like this.", "Harry Dunn: Trump is on the road to accountability — and the destination is a guilty verdict", "Inside the 'very intense' courtroom where Donald Trump was arraigned", "Lawrence: There is nothing Donald Trump respects. He tried to defraud a whole country.", "Trump shouldn’t bank on moving his 2020 election case out of D.C.", "DeSantis raises eyebrows with rhetoric about ‘slitting throats’", "Opinion | I never thought I'd hear Lizzo accused of fat-shaming women", "Opinion | Joe Biden calling his son is still not a scandal", "GOP senator offers her party excellent advice on Trump indictment", "The most important flaw in Rubio’s woeful new Trump defense", "Read annotated Trump indictment from Jack Smith's 2020 election probe", "The unfortunate timing of Trump’s newest offensive against Pence", "Opinion | The most chilling exchange of the new indictment", "Opinion | Sen. Bernie Sanders: The world is burning. Here's how we stop it.", "How the Ku Klux Klan Act ended up in the Donald Trump election subversion indictment", "Pelosi praises ‘courageous’ Jan. 6 Cmte. for work leading to Trump indictment", "'Let people see with their own eyes': Televise Trump election interference trial historian says", "Prosecutors build on Jan. 6th committee work to charge Trump", "5 details from Trump’s newest criminal case you might have missed", "Trump’s political depravity fully exposed by his innermost circle", "Nicolle: 'Desperate' Trump is exposed and in 'fear' amid massive criminal exposure", "Biden reverses Space Command move, causing outcry in Alabama"], "nytimes.com": ["Federal Court Again Strikes Down Alabama’s Congressional Map", "McConnell Releases New Health Assurances From the Capitol’s Physician", "Trump Media Buyer Gets More Time to Complete Long-Delayed Merger", "Wrestling With Inequality, Some Conservatives Redraw Economic Blueprint", "Biden Picks Jack Lew as Envoy to Israel During Time of Friction", "Consistent Signs of Erosion in Black and Hispanic Support for Biden", "North Korea Finds New Leverage in the Ukraine War", "In Chaotic Rhode Island Primary, 11 Democrats Vie for a House Seat", "First Lady Tests Positive for Covid, but President Does Not", "Peter Navarro to Face Contempt Trial Over Defiance of Jan. 6 Committee", "Kim Jong-un and Putin Plan to Meet in Russia to Discuss Weapons", "Faced With Evolving Threats, U.S. Navy Struggles to Change", "Nikki Haley Has a Playbook for Winning Tough Races, but 2024 Is Different", "South African Inquiry Rebuts U.S. Charge on Russian Arms", "New Hampshire Voters Like Ramaswamy, but More as a No. 2", "Florida’s Congressional Map Illegally Hurt Black Voters, Judge Rules", "Meet Fabian Nelson, Mississippi’s First Openly L.G.B.T.Q. Legislator", "Bill Richardson Reveled in Role of Freelance Envoy to Dictators", "Bill Richardson, Champion of Americans Held Overseas, Dies at 75", "Biden Team Isn’t Waiting for Impeachment to Go on the Offensive", "In Florida, Even a Hurricane Can’t Sweep Away Presidential Politics", "Biden Struggles to Make ‘Bidenomics’ a Plus, Not a Minus", "For Politicians, Vacations Can Be a Lot of Work", "Record Number of Families Cross Southern Border Illegally in August", "U.S. Knew About Migrant Killings by Saudi Forces Earlier Than Previously Disclosed", "DeSantis and Biden Won’t Meet in Florida During Tour of Hurricane Damage", "Plea Deal May Be Near for One of the Bali Bombing Defendants", "Two Proud Boys Sentenced in Jan. 6 Sedition Case", "U.S. Hiring Settles Into a Lower Gear", "Mitch McConnell May Be Experiencing Small Seizures, Doctors Suggest"], "washingtonpost.com": ["Schools close as manhunt for murderer who escaped prison nears a week", "Court undoes ruling allowing DOJ access to Scott Perry’s phone", "Alabama congressional map struck down again for diluting Black voting power", "Analysis | What must Ron Rivera do to keep his job? Your questions, answered.", "Analysis | Would Trump pardon the Proud Boys?", "Texas AG Ken Paxton pleads not guilty as historic impeachment trial begins", "U.S. Open fan ejected after Hitler phrase is yelled during match", "Truth Social investment partner extends deadline, avoiding liquidation", "Analysis | Biden’s age may be a growing problem for his reelection", "Former treasury secretary Jack Lew to be nominated ambassador to Israel", "Crowdfunding saves Florida abortion clinic with $193,000 in fines", "Analysis | College football’s biggest winners are those who can navigate the transfer portal", "‘No evidence’ McConnell has seizure disorder, congressional physician says", "Analysis | The subtext to voter concern about Biden’s age", "The scene at Burning Man festival after muddy conditions stranded attendees for days", "Ken Paxton’s Texas impeachment trial begins: Here’s what to know", "Ex-Proud Boys leader Tarrio to be sentenced for Jan. 6 Capitol attack", "Josh Harris’s debut joins list of Washington’s most anticipated NFL openers", "Analysis | Why a ‘perfect storm’ of misinformation may loom in 2024", "Todd Monken’s ‘freaking awesome’ task: Evolve the Ravens’ offense", "Olympic sports made the Pac-12 great. What happens to them now?", "Ukraine live briefing: Kremlin has ‘nothing to say’ on Putin-Kim meeting reports; drones downed near Moscow", "Five preposterously positive Washington Commanders predictions for 2023", "Analysis | Congress is coming back. Here's what to watch on climate and energy policy.", "Hong Kong court hands rare victory to advocates of same-sex unions", "Drivers squeezed as auto insurance costs soar across the U.S.", "A special congressional election in blue Rhode Island highlights party factions", "Could the 14th Amendment keep Trump off the ballot in 2024?", "North Korea, the original Hermit Kingdom, slowly reopens after covid", "Long sidelined, youth activists demand a say in online safety debate"], "theguardian.com": ["California judge arrested over wife’s gun killing", "Top Russian soprano axed over Ukraine invasion sues Met Opera", "Nicola Jennings on the latest interest rate rise – cartoon", "Sheffield Wednesday v Southampton: Championship season kicks off – live", "Do Not Expect Too Much From the End of the World review – giddy Romanian experiment", "Uganda’s Mary Cholhok: ‘Netball transformed my life into something amazing’", "Wiegman adapts England approach as World Cup giants pay for complacency | Jonas Eidevall", "‘Ignore them!’ Lineker’s advice on how BBC should deal with political opponents", "Great Britain women’s team fly to fastest pursuit qualifying time at worlds", "The Guardian view on the Niger putsch: regional pressure holds the key | Editorial", "The Guardian view on the Women’s World Cup: outstripping high expectations | Editorial", "Bloomsbury USA president dies in speedboat collision in Italy", "Fears of food inflation rise as UK harvests hit by cool, wet summer", "Breaking Bad actor Mark Margolis dies aged 83", "Rishi Sunak warned of concerns over NHS private sector partnerships", "Wales’ Warren Gatland thinking big as he seeks World Cup height advantage", "Why rap and drill are the folk music of today | Letters", "Ann Robinson obituary", "Texas border patrol agents find seven baby spider monkeys in backpack", "Dining alone can leave a bad taste in your mouth | Letters", "Glaring omissions in children’s TV round-up | Letters", "IVF is not the only option for lesbian couples | Letter", "Letter: Carl Davis the showman", "TV series that is a real Heartstopper | Letter", "Hoping Soft Machine are in for the long haul | Brief letters", "Talking Horses: Highfield Princess leads way for the mighty Quinn", "‘Two different lives’: how TikTok fame swept up mother who killed lover", "Italy’s ‘Attenzione pickpocket!’ social media star found to have far-right links", "Mo Foster obituary", "Eddie Izzard launches plan to become Labour candidate for Brighton Pavilion"]}